Repository: przemyslawbak/IT_Solutions
Catalog: *_Solutions/Resources/Services/ListItemFactory.*.resx
Languages: pl

# angular
source: We can create a SPA using the Angular framework. It allows for a better user experience. Angular is a TypeScript-based open-source web application framework led by the Angular Team at Google and by a community of individuals and corporations. Angular is a complete rewrite from the same team that built AngularJS.
pl: Możemy stworzyć SPA przy wykorzystaniu frameworku Angular. Pozwala on na przyjemniejsze korzystanie ze strony. Angular to oparty na języku TypeScript framework typu open source rozwijana przez zespół Angular w Google oraz społeczność osób i korporacji. Angular jest całkowicie przepisany przez ten sam zespół, który zbudował AngularJS.

# backend
source: If you need software that will improve your daily work or the work of your company? Or maybe you want to improve or develop the current systems? We are able to provide you with backend applications that will meet your requirements.
pl: Jeśli potrzebujesz oprogramowania które usprawni Twoją codzienną pracę, lub pracę Twojej firmy? A może chcesz ulepszyć albo rozwinąć obecne systemy? Jesteśmy w stanie Ci dostarczyć aplikacje backendowe którę będą spełniać Twoje wymagania.

source: Backend applications
pl: Aplikacje backendowe

# business
source: If you are looking for someone who will make a website business card for you, or a web application dedicated specifically to your business and made according to your requirements, we can design it, create it from scratch, or develop an existing solution that you use.
pl: Jeśli szukasz kogoś kto wykona Ci internetową stonę wizytówkę, lub aplikację webową, która będzie wyglądać dobrze także na urządzeniach mobilnych, dedykowaną specjalnie dla Twojego biznesu i wykonaną według Twoich wymagań, możemy Ci ją zaprojektować, stworzyć od podstaw, lub rozwinąć istniejące rozwiązanie z którego korzystasz.

source: Business websites
pl: Strony dla biznesu

# console
source: Sometimes the client needs a simple application without a fancy user interface to perform calculations or file operations. Console applications run on local machines with simple and convenient control work for this purpose. We are able to make one on request.
pl: Czasami klient potrzebuje prostej aplikacji bez wyszukanego interfejsu użytkownika, kóre będzie wykonywało obliczenia lub operacje na plikach. Do tego celu spisują się świenie aplikacje konsolowe uruchamiane na lokalnych maszynach z prostym i wygodnym starowaniem. Jesteśmy w stanie wykonać Ci taką na zlecenie.

source: Console applications
pl: Aplikacje konsolowe

# core
source: We work with ASP.NET Core. It is a free open source framework and successor to ASP.NET, developed by Microsoft. It is a modular structure that runs on both the full .NET Framework, Windows and the cross-platform .NET Core. The perfect solution for both corporations and small businesses.
pl: Pracujemy z ASP.NET Core. Jest to darmowy framework o otwartym kodzie źródłowym i następczyni ASP.NET, opracowana przez firmę Microsoft. Jest to modułowa struktura, która działa zarówno na pełnym .NET Framework, w systemie Windows, jak i na wieloplatformowym .NET Core. Idealne rozwiązanie zarówno dla korporacji jak i małego biznesu.

# desktop
source: A desktop windowing application is a program that can be run on a computer to perform a specific task by an end user. We are able to design and provide you with such a application created according to your guidelines and requirements.
pl: Desktopowa aplikacja okienkowa jest to program, który można uruchomić na komputerze w celu wykonania określonego zadania przez użytkownika końcowego. Jesteśmy w stanie zaprojektować i dostarczyć Ci taką plaikację stworzoną wedługo Twoich wytycznych oraz wymagań.

# mssql
source: We use Microsoft SQL Server in our projects. It is a reliable relational database management system developed by Microsoft. As a database server, it is software whose primary function is to store and retrieve data as required by other applications that can run on the same computer or on a different computer on the network.
pl: W naszyh projektach korzystamy z Microsoft SQL Server. Jest to niezawodny system zarządzania relacyjnymi bazami danych opracowany przez firmę Microsoft. Jako serwer bazy danych jest to oprogramowanie, którego podstawową funkcją jest przechowywanie i pobieranie danych zgodnie z wymaganiami innych aplikacji, które mogą działać na tym samym komputerze lub na innym komputerze w sieci.

# outsourcing
source: We are ready to cooperate with your company both in the implementation of entire projects and only its individual parts, using the technologies we work with.
pl: Jesteśmy gotowi na współpracę z Twoją firmą zarówno w implementacji całych projektów, jak i jedynie jego poszczególnych części, wykorzystując technologie w których pracujemy.

# rest
source: On request, we create RESTful Web API. Restful Web Services is a lightweight, maintainable, and scalable service that is built on the REST architecture. Restful Web Service, expose API from your application in a secure, uniform, stateless manner to the calling client app.
pl: Na życzenie tworzymy RESTful Web API. Restful Web Services to uproszczona, łatwa w utrzymaniu i skalowalna usługa oparta na architekturze REST. Restful Web Service, udostępniaj interfejs API z aplikacji w bezpieczny, jednolity, bezstanowy sposób wywołującej aplikacji klienckiej.

# uiux
source: We design the appearance and interfaces for various applications, ranging from web applications, through mobile applications, to programs run on local machines, all in cooperation with the client.
pl: Zajmujemy się projektowaniem wyglądu i interfejsów dla różnych aplikacji, począwszy od aplikacji webowych, przez mobilne, po programy uruchamiane na lokalnych maszynach, wszysto ze współpracą z klientem.

source: UI/UX design
pl: Projektowanie interfejsów użytkownika

# web
source: Web application Is application software that runs on a web server, unlike computer-based software programs that are run locally on the operating system (OS) of the device. Web applications are accessed by the user through a web browser with an active network connection. We are ready to create and maintain various types of responsive web applications.
pl: Aplikacja internetowa Jest to aplikacja działająca na serwerze sieciowym, w przeciwieństwie do programów komputerowych uruchamianych lokalnie w systemie operacyjnym (OS) urządzenia. Użytkownik uzyskuje dostęp do aplikacji internetowych za pośrednictwem przeglądarki internetowej z aktywnym połączeniem sieciowym. Jesteśmy gotowi do tworzenia i utrzymywania różnego rodzaju responsywnych aplikacji internetowych, które przygotowane do wyświetlenia w przeglądarkach urządzeń mobilnych.

source: Web applications
pl: Aplikacje webowe

source: Windows desktop applications
pl: Aplikacje okienkowe dla Window

# wpf
source: Windows Presentation Foundation is used by us to create desktop applications and Web API clients. It is a free and open-source graphical subsystem originally developed by Microsoft for rendering user interfaces in Windows-based applications.
pl: Windows Presentation Foundation służy nam do tworzenia aplikacji desktopowych oraz klientów Web API. Jest to darmowy podsystem graficzny typu open source, pierwotnie opracowany przez firmę Microsoft do renderowania interfejsów użytkownika w aplikacjach opartych na systemie Windows.
